about_company = """То, что выглядит просто, но при этом работает – непросто. 

Наши усилия направлены на оптимизацию известных конструкций сельскохозяйственных машин. В наших машинах меньше деталей и эти детали проще в изготовлении. За счет этих решений мы можем позволить себе не экономить на материалах и комплектующих, сохраняя приемлемый уровень цен. 
Наша техника рассчитана служить долгие годы и требовать минимум внимания. Жертвой оптимизации может стать дополнительный функционал, но надежность и долговечность – всегда остаются в приоритете!
Наши инженеры-конструкторы не заперты в кабинетах, а технологи в цехах. Мы общаемся друг с другом, изучаем новые мировые технологии, выезжаем к клиентам, спорим и находим новые решения. Закрепляем успехи и фиксируем неудачи в специализированном софте. Опять спорим. И движемся вперед…
Профессионально неуступчивый,
но дружный коллектив АО «СТЕЛЛАР»"""


personality = f"Представь, что ты специалист по персоналу копании АО «СТЕЛЛАР» в г.Барнауле, тебя зовут Алиса, ты очень любишь свою компанию и заботишься о е коллективе."

transport = """Время и маршрут служебного автобуса:
7.20 отправление от маг.Аяс на Павловском тракте, 86
7.22 ост.Георгиева (ТЦ Европа)
7.23 ост.Панфиловцев (Павловский тракт, 142в)
7.25 ост.Сиреневая (Гипермаркет Лента)
7.25 ТЦ Доммер
7.26 ост.Солнечная Поляна (Павловский тракт)
7.27 ост. ТЦ Арена
7.37-7.40 ул. Звездная, 13 (АО Стеллар)\n
Время и маршрут от завода: 
время отправления 16:55
17.00 ост. ТЦ Арена
17.05 ост. ТЦ Доммер
17.10 ост.Сиреневая (Гипермаркет Лента)
17.15 ост. Панфиловцев
17.20 ост.Георгиева (ТЦ Европа
крайняя Павловский тракт, 249в (Мерседес центр)\n"""


how_to_use = """Этот телеграм-бот предназначен для облегчения адаптации новых сотрудников, для получения доступа к информации, необходимо ввести код должности, который Вам должны отправить при трудоустройстве. 
Код должности представляет собой уникальный набор символов, без его ввода пользоваться ботом не получится. Вводить код нужно только один раз, далее Бот Вас запомнит. \n
 Для перехода к необходимой информации используйте главное меню бота, оно расположено в нижней части экрана. Так же бот имеет поддержку диалогового режима, с помощью ChatGPT, но количество запросов в этом режиме ограничено.
На текущий момент контекст диалога динамический и по мере заполнения памяти самые старые сообщения "забываются", (Бот запоминает порядка 10 последних сообщений) 
но можно очистить их принудительно, тогда бот забудет о чем Вы говорили, чтобы его очистить, нажмите /clear \n
Для просмотра количества доступных токенов нажмите /tokens
Для обновления токенов нажмите /get_tokens
"""


about_bot = """Данный телеграм Бот поможет Вам с началом знакомства с историей и политикой компаниии, поможет освоиться в новом коллективе и облегчит процесс изучения внутренних регламентов и корпоративных правил.
 Бот поможет  улучшить адаптацию, сделать Ваши первые дни на работе более комфортными и  сделать процесс обучения более эффективным.
Для связи с сотрудниками HR отдела есть специальный раздел, для перехода в него нажмите /help и далее - Как связаться с сотрудниками HR отдела"""


contacts = """Для связи с HR отделом, можете воспользоваться контактом сотрудника, который проводил Ваше первичное собеседование,
если он у Вас не сохранился, воспользуйтесь общим телефоном отдела: +7 (385) 2хх-хх-хх или +7 (962) ххх-хх-хх"""


kitchen = """Общие правила:
 Соблюдайте чистоту и порядок.
 Используйте посуду и бытовую технику по назначению.
 Не оставляйте после себя грязную посуду.
 Не разбрасывайте мусор, используйте мусорные баки.
 Не оставляйте продукты питания без упаковки.
 Соблюдайте правила личной гигиены.
 Не используйте мобильные телефоны в душевой.
 Запрещено курить в помещениях.
 Запрещено употреблять алкогольные напитки на территории предприятия.
 Бережно относитесь к имуществу предприятия.

Кухня:
 Используйте только чистую посуду и столовые приборы.
 Не оставляйте включенными плиты, микроволновую печь, чайники и другую бытовую технику без присмотра.
 Мойте посуду сразу после использования.
 Не оставляйте грязные раковины и столешницы.
 Не храните личные вещи в холодильнике.
 Не используйте холодильник для хранения личных продуктов питания.
 Не используйте холодильник для подогрева пищи.
 Не оставляйте продукты питания открытыми надолго.
 Не используйте духовку для разогрева пищи.
 Не используйте кухню для личных целей, кроме приёма пищи.
 Соблюдайте правила хранения продуктов питания.

Душевая:
 Принимайте душ только в специальной одежде.
 Не используйте душевую для стирки белья.
 Не оставляйте мокрый пол после использования душевой.
 Не используйте душевую для личных целей, кроме гигиены.
 Не бросайте мусор в душевую.
 Соблюдайте правила личной гигиены.

Ответственность:
 За нарушение правил пользования кухней и душевой сотрудники несут ответственность в соответствии с трудовым законодательством.

Дополнительные замечания:
 Администрация предприятия имеет право вносить изменения в данные правила.
 Все сотрудники должны быть ознакомлены с данными правилами.

Просим вас соблюдать эти правила, чтобы обеспечить комфортные и безопасные условия для всех сотрудников."""


posts = {'bITbos': 'Технический директор',
         'maNIng': 'Инженер по подготовке производства',
         'FVKMBx': 'Главный механик',
         'LuMFGU': 'Электрик',
         'EGoSfD': 'Слесарь механосборочных работ',
         'WiPgEh': 'Заведующий по хозяйственной части',
         'IssioN': 'Уборщик производственных и служебных помещений',
         'wCJpeS': 'Служба логистики',
         'ZkZEmB': 'Логист производства',
         'FnWuRK': 'Разнорабочий',
         'MARrNX': 'Старший мастер',
         'fYToKz': 'Электросварщик ручной сварки 3-го разряда',
         'wKnloP': 'Электросварщик ручной сварки 4-го разряда',
         'QwnHBl': 'Электросварщик ручной сварки 2-го разряда',
         'BcRkQK': 'Электросварщик ручной сварки 1-го разряда',
         'gbKMIR': 'Оператор листогибочного станка с ЧПУ',
         'RXNxXj': 'Оператор ленточнопильного станка с ЧПУ',
         'HzfATe': 'Оператор лазерных установок',
         'gBsGYD': 'Помощник оператора лазерных установок',
         'jwHPNH': 'Токарь 4-го разряда',
         'YXynmF': 'Токарь 5-го разряда',
         'kATRKp': 'Оператор токарного станка с ЧПУ 4-го разряда',
         'uCkNbC': 'Наладчик фрезерного станка с ЧПУ',
         'RPoWfI': 'Слесарь механосборочных работ',
         'lTdSal': 'Термист 3 разряда',
         'pHNoKx': 'Оператор автоматических и полуавтоматических линий станков и установок',
         'sTXnbC': 'Старший мастер',
         'aDHoiO': 'Мастер',
         'wTRObL': 'Слесарь-сборщик',
         'ZgdBjd': 'Слесарь механосборочных работ',
        }

post_learn_links = {'bITbos': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'maNIng': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'FVKMBx': ['https://disk.yandex.ru/i/_1mj5otOkPz1MQ', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/_1mj5otOkPz1MQ', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'LuMFGU': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'EGoSfD': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'WiPgEh': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'IssioN': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'wCJpeS': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'ZkZEmB': ['https://disk.yandex.ru/i/3WNSsoXnPq49nQ', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/3WNSsoXnPq49nQ', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'FnWuRK': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'MARrNX': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'fYToKz': ['https://disk.yandex.ru/i/xNWx-qaPfzXDyg', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/xNWx-qaPfzXDyg', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'wKnloP': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'QwnHBl': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'BcRkQK': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'gbKMIR': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'RXNxXj': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'HzfATe': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'gBsGYD': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'jwHPNH': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'YXynmF': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'kATRKp': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'uCkNbC': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'RPoWfI': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'lTdSal': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'pHNoKx': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'sTXnbC': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'aDHoiO': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/GSEedBphmUVjlQ', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/GSEedBphmUVjlQ'],
                     'wTRObL': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                     'ZgdBjd': ['https://disk.yandex.ru/i/FDchCwlp19Sv1w', 'https://disk.yandex.ru/i/FDchCwlp19Sv1w'],
                    }