about_company = """То, что выглядит просто, но при этом работает – непросто. 

Наши усилия направлены на оптимизацию известных конструкций сельскохозяйственных машин. В наших машинах меньше деталей и эти детали проще в изготовлении. За счет этих решений мы можем позволить себе не экономить на материалах и комплектующих, сохраняя приемлемый уровень цен. 
Наша техника рассчитана служить долгие годы и требовать минимум внимания. Жертвой оптимизации может стать дополнительный функционал, но надежность и долговечность – всегда остаются в приоритете!
Наши инженеры-конструкторы не заперты в кабинетах, а технологи в цехах. Мы общаемся друг с другом, изучаем новые мировые технологии, выезжаем к клиентам, спорим и находим новые решения. Закрепляем успехи и фиксируем неудачи в специализированном софте. Опять спорим. И движемся вперед…
Профессионально неуступчивый,
но дружный коллектив АО «СТЕЛЛАР⁠»"""
transport = """Время и маршрут служебного автобуса:
7.20 отправление от маг.Аяс на Павловском тракте, 86
7.22 ост.Георгиева (ТЦ Европа)
7.23 ост.Панфиловцев (Павловский тракт, 142в)
7.25 ост.Сиреневая (Гипермаркет Лента)
7.25 ТЦ Доммер
7.26 ост.Солнечная Поляна (Павловский тракт)
7.27 ост. ТЦ Арена
7.37-7.40 ул. Звездная, 13 (АО Стеллар)\n
Время и маршрут от завода: 
время отправления 16:55
17.00 ост. ТЦ Арена
17.05 ост. ТЦ Доммер
17.10 ост.Сиреневая (Гипермаркет Лента)
17.15 ост. Панфиловцев
17.20 ост.Георгиева (ТЦ Европа
крайняя Павловский тракт, 249в (Мерседес центр)\n"""
how_to_use = """Старт на экране нажаль, есль бот не узнавайт, должнась вводиль, бот сразу узнавайт. 
Потом меню жмайт, видео сматрель, схема маршруйт-шмаршруйт сматрель, трудвой распрдок сматрель, запаминайт. 
Сё тпрь маладес, все знайт.
Для просмотра доступных токенов нажмите /tokens
Для обновления токенов нажмите /get_tokens
Для очистки контекста диалога с ChatGPT нажмите /clear"""
about_bot = """Бот предназначен для первичного знакосмтва с компанией, изучения внутренних регламентов и корпоративных правил"""
contacts = """Для связи с HR отделом, можете воспользоваться контактом сотрудника, который проводил Ваше первичное собеседование,
если он у Вас не сохранился, воспользуйтесь общим телефоном отдела: """
kitchen = """Куйхня - муйхня ходиль, еда кушаль, дущь мытця ходиль, за собой убраль """
